Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Interacting with a datastore typically implies first connecting using credentials. Those credentials will allow the client to be identified, authenticated and eventually authorized. Username/password based authentication is very common, but that is not by any means the only one. Such credentials information may appear in the application configuration, but it is becoming increasingly popular to store this type of sensitive information in secure stores, such as HashiCorp Vault, Azure Key Vault or the AWS Secrets Manager to name just a few.
ja_jp: データストアとのやりとりは、通常、最初にクレデンシャルを使用して接続することを意味します。これらのクレデンシャルによって、クライアントは識別され、認証され、最終的には認可されるようになります。ユーザー名/パスワードベースの認証は非常に一般的ですが、それだけではありません。このようなクレデンシャル情報はアプリケーションの設定に存在するかもしれませんが、HashiCorp Vault、Azure Key Vault、AWS Secrets Managerなどのセキュアなストアにこのタイプの機密情報を保存することが一般的になってきています。

source: Interacting with the Greeting Service
ja_jp: Greeting サービスとの連携

source: Interacting with the application
ja_jp: アプリケーションとの相互作用

source: Interaction with Mutiny and MicroProfile Context Propagation
ja_jp: Mutiny と MicroProfile のコンテキスト伝搬との相互作用

source: Interactive Queries
ja_jp: インタラクティブクエリ

source: Interactive actions (e.g., buttons, toggles)
ja_jp: インタラクティブなアクション (例: ボタン、トグル)

source: Interactive entries that navigate to custom pages contributed by the extension. A page link can also optionally contain a label that we discuss later.
ja_jp: エクステンションによって提供されるカスタムページに移動するインタラクティブなエントリ。ページリンクは、後で説明するラベルをオプションで含むこともできます。

source: Interactive terminal
ja_jp: インタラクティブターミナル

source: Interacts with the Quarkus application to resolve ACME challenges.
ja_jp: Quarkus アプリケーションと対話して ACME チャレンジを解決します。

source: Intercepted self-invocation
ja_jp: インターセプトされた自己呼び出し

source: Intercepting HTTP requests
ja_jp: HTTP リクエストのインターセプト

source: Intercepting Producer Methods and Synthetic Beans
ja_jp: インターセプトプロデューサーメソッドと合成 Bean

source: Interception of Static Methods
ja_jp: 静的メソッドのインターセプション

source: Interceptor bindings are often `@Inherited`, but don't have to be.
ja_jp: インターセプター バインディングはしばしば `@Inherited` ですが、そうでなければならない訳ではありません。

source: Interceptor methods on superclasses are not implemented yet
ja_jp: スーパークラスのインターセプターメソッドは実装されていません。

source: Interceptors
ja_jp: インターセプター

source: Interceptors are used to separate cross-cutting concerns from business logic. There is a separate specification - Java Interceptors - that defines the basic programming model and semantics.
ja_jp: インターセプターは、横断的な問題をビジネス・ロジックから分離するために使用されます。基本的なプログラミングモデルとセマンティクスを定義した Java Interceptors という別の仕様があります。

source: Interceptors can use `InvocationContext.getMethod()` to detect static methods and adjust the behavior accordingly.
ja_jp: インターセプターは `InvocationContext.getMethod()` を使用してStaticメソッドを検出し、それに応じて動作を調整することができます。

source: Interceptors for configuration value resolution
ja_jp: 設定値解決のためのインターセプタ―

source: Interceptors for lifecycle event callbacks: `@PostConstruct`, `@PreDestroy`, `@AroundConstruct`
ja_jp: ライフサイクルイベントコールバックのためのインターセプター: `@PostConstruct`、 `@PreDestroy`、 `@AroundConstruct`

source: Interceptors may also be created with an implementation of `io.smallrye.config.ConfigSourceInterceptorFactory`. Each implementation requires registration via the https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] mechanism in the `META-INF/services/io.smallrye.config.ConfigSourceInterceptorFactory` file.
ja_jp: インターセプターは、 `io.smallrye.config.ConfigSourceInterceptorFactory` の実装で作成することもできます。それぞれの実装は、link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader]メカニズムを介して、 `META-INF/services/io.smallrye.config.ConfigSourceInterceptorFactory` ファイルで 登録が必要です。

source: Interceptors may also be created with an implementation of `io.smallrye.config.ConfigSourceInterceptorFactory`. Each implementation requires registration via the https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] mechanism in the `META-INF/services/io.smallrye.config.ConfigSourceInterceptorFactory` file.
ja_jp: インターセプターは、 `io.smallrye.config.ConfigSourceInterceptorFactory` の実装で作成することもできます。 各実装には、 `META-INF/services/io.smallrye.config.ConfigSourceInterceptorFactory` ファイル内の link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] メカニズムによる登録が必要です。

source: Interceptors with the highest priority are called first. The default priority, used if the interceptor does not implement the `Prioritized` interface, is `0`.
ja_jp: 最高の優先度を持つインターセプターが最初に呼び出されます。インターセプターが `Prioritized` インターフェイスを実装していない場合に使用されるデフォルトの優先度は `0` です。

source: Interested in having the Quarkus Tour come through your local Java User Group? Contact us today to get more details and make it happen.
ja_jp: 地元のJavaユーザーグループでQuarkus Tourを開催することに興味がありますか？詳細をお知りになりたい方は、今すぐお問い合わせください。

source: Interface for custom message is ackTimeout policy. You can specify `RedeliveryBackoff` for a consumer.
ja_jp: カスタム・メッセージのインターフェースは ackTimeout ポリシーです。コンシューマに対して `RedeliveryBackoff` を指定できます。

source: Interface for custom message is negativeAcked policy. You can specify `RedeliveryBackoff` for a consumer.
ja_jp: カスタム・メッセージのインタフェースは negativeAcked ポリシーです。コンシューマには `RedeliveryBackoff` を指定できます。

source: Interfaces
ja_jp: インターフェイス

source: Interfaces that extend any of the following Spring Data repositories are automatically implemented:
ja_jp: 次の SpringData リポジトリーのいずれかを拡張するインターフェイスが自動的に実装されます。

source: Interfaces that extend any of the following Spring Data repositories get automatically generated REST endpoints:
ja_jp: 以下のSpring Dataリポジトリを拡張するインターフェイスは、自動的にRESTエンドポイントが生成されます:

source: Internal Channels
ja_jp: 内部チャネル

source: Internal components
ja_jp: 内部コンポーネント

source: Internal container ports stay the same; e.g. 3000 for Grafana, 4317 for OTel gRPC, 4318 for OTel HTTP, etc
ja_jp: 内部コンテナーポートは同じままです。例: Grafana は 3000、OTel gRPC は 4317、OTel HTTP は 4318 など。

source: Internally Quarkus uses JBoss Logging; you can also use it inside your application so that no other dependencies should be added for your logs.
ja_jp: Quarkusは内部的にJBoss Loggingを使用しています。アプリケーションの内部で使用することもできるので、ログに他の依存関係を追加する必要はありません。

source: Internally, Quarkus uses JBoss Log Manager and the JBoss Logging facade. You can use the JBoss Logging facade inside your code as it's already provided, or any of the supported Logging API listed in the next chapter as Quarkus will send them to JBoss Log Manager.
ja_jp: 内部的には、QuarkusはJBoss Log ManagerとJBoss Logging ファサードを使用します。 JBoss Logging ファサードはすでに提供されているので、コード内部で使用することができますが、QuarkusがJBoss Log Managerに送信するため、次の章でリストアップされているサポートされたロギングAPIのいずれかを使用することもできます。

source: Internally, the identity providers create and update an instance of the `io.quarkus.security.identity.SecurityIdentity` class which holds the principal, roles, credentials which were used to authenticate the client (user) and other security attributes. An easy option to customize `SecurityIdentity` is to register a custom `SecurityIdentityAugmentor`. For example, the augmentor below adds an addition role:
ja_jp: 内部的には、アイデンティティ プロバイダは、プリンシパル、役割、クライアント(ユーザー)の認証に使用されたクレデンシャル、 およびその他のセキュリティー属性を保持する `io.quarkus.security.identity.SecurityIdentity` クラスのインスタンスを作成して更新します。 `SecurityIdentity` をカスタマイズする簡単なオプションは、カスタム `SecurityIdentityAugmentor` を登録することです。例えば、以下のオーグメンターは、追加のロールを追加します。 :

source: Interpolate a single value identified by a given field in a Secret or ConfigMap
ja_jp: SecretまたはConfigMapの指定されたフィールドで識別される単一の値を補間します。

source: Interpolate a value from a field within the same resource
ja_jp: 同じリソース内のフィールドから値を補間します。

source: Interval Config Property Example
ja_jp: インターバル設定プロパティーの例

source: Interval Config Property Example with a Default Value
ja_jp: デフォルト値のあるインターバル設定プロパティーの例

source: Interval Trigger Example
ja_jp: インターバルトリガーの例

source: Interval to print client stats (in seconds).
ja_jp: クライアントの統計情報を出力する間隔（秒）。

source: Intervals
ja_jp: インターバル

source: Intervals can be disabled by setting their value to `"off"` or `"disabled"`. So for example a Property Expression with the default value `"off"` can be used to disable the trigger if its Config Property has not been set.
ja_jp: Intervals は、その値を `"off"` または `"disabled"` に設定することで無効にすることができます。そのため、例えば、デフォルト値 `"off"` のプロパティ式は、そのConfig Propertyが設定されていない場合、トリガーを無効にするために使用することができます。

source: Intimate knowledge of Maven was no longer required
ja_jp: Mavenを熟知している必要はありませんでした

source: Intro
ja_jp: イントロ

source: Introduce @SearchExtension to configure Hibernate Search through annotated beans
ja_jp: アノテートされたBeanを通してHibernate Searchを設定するために@SearchExtensionを導入

source: Introduce support for MongoDB service binding
ja_jp: MongoDBサービスバインディングのサポートの導入

source: Introducing **Logicdrop Fusion**, our new cloud-native platform powered by Quarkus.
ja_jp: Quarkusを採用した当社の新しいクラウドネイティブプラットフォーム **Logicdrop Fusion** をご紹介します。

source: Introducing Kafka Streams DevUI
ja_jp: Kafka Streams DevUIの導入

source: Introduction
ja_jp: はじめに

source: Introduction to CDI
ja_jp: CDI入門

source: Introduction to Contexts and Dependency Injection
ja_jp: コンテキストと依存性注入(CDI)の紹介

source: Introduction to Contexts and Dependency Injection (CDI)
ja_jp: コンテキストと依存性注入(CDI)の紹介

source: Introduction to Cryostat for Quarkus developers and step-by-step guide on configuring Quarkus applications for Cryostat compatibility
ja_jp: Quarkus開発者向けのCryostatの紹介と、Cryostat互換のためのQuarkusアプリケーションの設定に関するステップバイステップガイド

source: Introduction to Quarkus (5-10 mins)
ja_jp: Quarkusの紹介（5～10分

source: Introduction to WebAuthn
ja_jp: WebAuthnの紹介

source: Introduction to customizable service discovery and client-side load-balancing with Quarkus and SmallRye Stork
ja_jp: QuarkusとSmallRye Storkによるカスタマイズ可能な サービスディスカバリーとクライアントサイドロードバランシングの紹介

source: Introduction to the Quarkus Superheroes sample application, discusses some of the requirements for building it, and illustrates how to run it locally or deploy it to Kubernetes.
ja_jp: Quarkus Superheroesのサンプルアプリケーションを紹介し、構築に必要ないくつかの要件を説明し、ローカルで実行する方法やKubernetesにデプロイする方法を説明します。

source: Introduction to the Service Binding Operator
ja_jp: サービスバインディング Operator の紹介

source: Introduction to writing REST JSON Services
ja_jp: REST JSONサービス入門

source: Introspect
ja_jp: イントロスペクト

source: Introspection
ja_jp: イントロスペクション

source: Introspection Endpoint Authentication
ja_jp: イントロスペクションエンドポイント認証

source: Introspection credentials
ja_jp: イントロスペクションクレデンシャル

source: Introspection credentials properties
ja_jp: イントロスペクションクレデンシャルプロパティー

source: Introspection endpoint authentication
ja_jp: イントロスペクションエンドポイント認証

source: Introspection name
ja_jp: イントロスペクション名

source: Introspection secret
ja_jp: イントロスペクションシークレット

source: Invalid use of the `@Gauge` annotation is now reported:
ja_jp: `@Gauge` アノテーションの無効な使用が報告されるようになりました。

source: Inventory file
ja_jp: インベントリファイル

source: Inverts the evaluated value.
ja_jp: 評価された値を反転します。

source: Investigating issues in a timely fashion, and depending on the situation either providing fixes, guidance on applying the right approach, or workarounds.
ja_jp: 問題をタイムリーに調査し、状況に応じて、修正、正しいアプローチの適用に関するガイダンス、または回避策を提供すること。

source: Invocation rules
ja_jp: 呼び出しルール

source: Invoke `RowSet#next` until it returns `null`.
ja_jp: `null` を返すまで `RowSet#next` を呼び出します。

source: Invoke a service method:
ja_jp: サービスメソッドの呼出：

source: Invoke login
ja_jp: ログインの呼出

source: Invoke registration
ja_jp: 登録の呼出

source: Invoke the Lambda
ja_jp: Lambda の呼び出し

source: Invoke the `TaskBean#performTask()` method from the job. Jobs are also xref:cdi.adoc[container-managed] beans if they belong to a link:cdi-reference[bean archive].
ja_jp: ジョブから `TaskBean#performTask()` メソッドを呼び出します。ジョブは、 link:cdi-reference[Bean アーカイブ] に属している場合、 link:cdi.html[コンテナ管理された] Beanでもあります。

source: Invoke the desired logging methods on the `log` object.
ja_jp: `log` オブジェクトに対して、必要なロギングメソッドを呼び出します。

source: Invoke the endpoint to send the multicast packets:
ja_jp: エンドポイントを呼び出して、マルチキャストパケットを送信します。

source: Invoke the function
ja_jp: 関数の呼出

source: Invoke the service.
ja_jp: サービスを起動します。

source: Invokes the asynchronous function. This is particularly convenient to execute asynchronous side effect actions.The downstream receives the original event, or a failure if the consumer throws an exception or if the produced Uni emits a failure.
ja_jp: 非同期関数を呼び出します。これは、非同期の副作用のあるアクションを実行する際に特に便利です。ダウンストリームは、元のイベントを受け取りますが、コンシューマーが例外を投げた場合や生成されたUniが失敗を発した場合は失敗となります。

source: Invokes the asynchronous function. This is particularly convenient to execute asynchronous side-effect actions.The downstream receives the original event, or a failure if the consumer throws an exception or if the produced Uni emits a failure.
ja_jp: 非同期関数を呼び出します。これは、非同期の副作用アクションを実行する際に特に便利です。ダウンストリームは、元のイベントを受け取りますが、コンシューマーが例外を投げた場合や、生成されたUniが失敗を発した場合は失敗となります。

source: Invokes the synchronous consumer. This is particularly convenient to execute side effects actions. The downstream receives the original event, or a failure if the consumer throws an exception
ja_jp: 同期型コンシューマーを呼び出します。これは特に副作用のあるアクションを実行するのに便利です。ダウンストリームは元のイベントを受け取りますが、コンシューマが例外を投げた場合は失敗となります。

source: Invokes the synchronous consumer. This is particularly convenient to execute side-effects actions. The downstream receives the original event, or a failure if the consumer throws an exception
ja_jp: 同期型コンシューマーを呼び出します。これは特に副作用のあるアクションを実行するのに便利です。ダウンストリームは元のイベントを受け取りますが、コンシューマが例外を投げた場合は失敗となります。

source: Invoking the other functions in the quickstart requires an HTTP POST. To execute the `greet` function defined in link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/GreetingFunction.java[GreetingFunction.java] invoke this curl script.
ja_jp: クイックスタート内の他の関数を呼び出すにはHTTP POSTが必要です。 link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/GreetingFunction.java[GreetingFunction.java] で定義された `greet` 関数を実行するには、このcurlスクリプトを呼び出します。

source: Invoking the other functions in the quickstart requires an HTTP POST. To execute the `greet` function defined in {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/GreetingFunction.java[GreetingFunction.java] invoke this curl script.
ja_jp: クイックスタートの他の Function を呼び出すには、HTTP POST が必要です。 {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/GreetingFunction.java[GreetingFunction.java] で定義されている `greet` 関数を実行するには、この curl スクリプトを呼び出します。

source: Is RESTEasy Reactive limited to using reactive APIs?
ja_jp: RESTEasy Reactive はリアクティブAPIの使用に限定されているのでしょうか?

source: Is illustrating how you add dependencies to this script. This is a feature of JBang.
ja_jp: は、このスクリプトに依存関係を追加する方法を説明しています。これはJBangの機能です。

source: Is it less secure than the `stateful` approach ? It is hard to give a precise answer. The `stateful` approach does not protect the session cookie, if the attacker gets hold of it, the secure access is compromised. Thefore, with either approach, using HTTPS and applying additional CORS and CSRF controls must be considered.
ja_jp: `stateful` (ステートフル) なアプローチよりも安全性が低いのでしょうか？正確な答えを出すのは困難です。`stateful` なアプローチではセッションクッキーを保護しないため、攻撃者がそれを入手するとセキュアなアクセスが侵害されます。したがって、どちらのアプローチでも、HTTPS の使用と追加の CORS および CSRF 制御の適用を検討する必要があります。

source: Is the name of the AsciiDoc source file that you want to redirect to, without the `.adoc` file extension.
ja_jp: リダイレクトしたいAsciiDocのソースファイル名があるか。 `.adoc` のファイル拡張子は除きます。

source: Is the name of the original AsciiDoc source file that you are retiring, without the `.adoc` file extension.
ja_jp: 破棄したい元のAsciiDocソースファイル名があったか。 `.adoc` ファイル拡張子を除きます。

source: Is this a clean start or a live reload
ja_jp: クリーンスタートなのか、ライブリロードなのか

source: Is this information in the right place? For example, if this is a reference, should some of this content be moved to a concept doc or how-to guide instead?
ja_jp: この情報は適切な場所にありますか? 例えば、これがリファレンスであれば、このコンテンツの一部をコンセプトドキュメントやハウツーガイドに移すべきでしょうか?

source: Isn't Project Leyden supposed to improve the class loading story, among other things?
ja_jp: 「Project Leyden は、他の機能とともにクラスロードの問題も改善してくれるはずではないか？」

source: Isn't it the best kind of story?
ja_jp: これこそ、最高の物語だと思いませんか？

source: Isolated ClassLoaders
ja_jp: 分離型クラスローダー

source: Isolates are a neat feature of GraalVM, but Quarkus isn't using them at this stage.
ja_jp: 分離はGraalVMの優れた機能ですが、Quarkusは現段階では使用していません。

source: Issue a certificate
ja_jp: 証明書の発行

source: Issuer (`iss`) claim value
ja_jp: 発行者 (`iss`) クレーム値

source: Issuer based tenant resolution
ja_jp: 発行者ベースのテナント解決

source: Issues
ja_jp: 課題

source: Issues a Let's Encrypt certificate request.
ja_jp: Let's Encrypt 証明書リクエストを発行します。

source: Issues and Feature requests
ja_jp: 課題・機能要望

source: Issues using GraalVM with macOS
ja_jp: macOS で GraalVM を使用する場合の問題

source: Issues using GraalVM with macOS Catalina
ja_jp: macOS CatalinaでGraalVMを使用している場合の問題

source: Issues with packaging on Windows
ja_jp: Windows でのパッケージ化に関する問題

source: It adds the following extensions to your build file:
ja_jp: ビルドファイルに次のエクステンションが追加されます。

source: It all started by helping developers update their code to run in a new https://developers.redhat.com/products/eap/[JBoss EAP] version, a "piece of cake". That’s why the tool started by being called "JBoss Cake" back in 2012. It kept evolving to be able to be used to modernize Java code and move it from WebLogic or WebSphere to JBoss EAP or https://developers.redhat.com/products/webserver/[JBoss Web Server] (the Red Hat Supported build of Tomcat), when it became the Red Hat Application Migration Toolkit. It kept being improved by developers and consultants, bringing their experience by working in the first line with production code, who wrote more and better rules, increasing the number of covered cases.
ja_jp: その始まりは、開発者がコードを更新して link:https://developers.redhat.com/products/eap/[JBoss EAP]の新バージョンで実行できるようにすることを簡単にするためでした。そのため、このツールは2012年に「JBoss Cake」と呼ばれることから始まりました。その後、JavaコードをモダナイズしてWebLogicやWebSphereからJBoss EAPや link:https://developers.redhat.com/products/webserver/[JBoss Web Server]（TomcatのRed Hatがサポートするビルド）に移行する際に使用できるように進化を続け、Red Hat Application Migration Toolkitとなりました。このツールは、開発者やコンサルタントによって改良され続けています。開発者やコンサルタントは、本番コードの第一線で働いた経験を生かして、より良いルールを書き、対象となるケースを増やしていきました。

source: It all started with me complaining, more than once, that improving startup performance in Quarkus had become really hard. Startup was cluttered with class loading noise. Which means that every time you looked at a startup profile, you clicked on something suspicious and realized:
ja_jp: すべては、Quarkus の起動パフォーマンスを改善するのが非常に難しくなってきたと、私が何度もぼやいたことから始まりました。起動プロセスはクラスロードのノイズで埋め尽くされていました。つまり、起動時のプロファイルを確認するたびに、何か怪しい部分をクリックしては次のように気づくことの繰り返しだったのです。

source: It allows Keycloak to evaluate resource-based permissions dynamically by using attributes such as resource name, identifier, or URI.
ja_jp: これにより、Keycloak はリソース名、識別子、URI などの属性を使用して、リソースベースの権限を動的に評価できるようになります。

source: It allows more advanced reactive use cases, for example, you can use it to send server-sent events (SSE) via Quarkus REST:
ja_jp: これにより、より高度なリアクティブユースケースが可能になります。たとえば、Quarkus REST 経由でサーバー送信イベント (SSE) を送信できます。

source: It allows more advanced reactive use cases, for example, you can use it to send server-sent events (SSE) via RESTEasy Reactive:
ja_jp: これにより、より高度なリアクティブなユースケースが可能となり、例えば、RESTEasyを介してSSE（Server-Sent Event）を送信するために使用することができます。

source: It allows more advanced reactive use cases, for example, you can use it to send server-sent events (SSE) via RESTEasy:
ja_jp: これにより、より高度なリアクティブなユースケースが可能となり、例えば、RESTEasyを介してSSE（Server-Sent Event）を送信するために使用することができます。

source: It allows you to quickly visualize all the extensions currently loaded, see their status and go directly to their documentation.
ja_jp: これにより、現在ロードされているすべてのエクステンションを素早く可視化し、そのステータスを確認し、ドキュメントに直接アクセスすることができます。

source: It allows you to:
ja_jp: これにより、次のことが可能になります:

source: It also adapts the Vert.x back pressure protocol to Reactive Streams, as Mutiny implements Reactive Streams.
ja_jp: また、MutinyがReactive Streamsを実装しているため、Vert.xのバックプレッシャープロトコルをReactive Streamsに適応させています。

source: It also brings support for Hibernate Spatial, allowing developers to work with spatial data types and perform spatial queries in their Quarkus applications.
ja_jp: また、Hibernate Spatialのサポートも導入され、開発者はQuarkusアプリケーションで空間データ型を操作し、空間クエリを実行できるようになります。

source: It also enables producer idempotence support.
ja_jp: これは、プロデューサーの冪等性のサポートも有効化します。

source: It also means that if you were relying on content type negotiation, you will have to add these annotations with the content types you support.
ja_jp: また、コンテンツタイプネゴシエーションに頼っていた場合、サポートしているコンテンツタイプでこれらのアノテーションを追加しなければいけません。

source: It also provides a global context map you can use to store information between restarts, without needing to resort to static fields.
ja_jp: また、静的なフィールドに頼ることなく、再起動の間に情報を保存するために使用できるグローバルなコンテキストマップを提供しています。

source: It also works for groups:
ja_jp: グループでも有効です：

source: It applies the same approach to Quarkus configuration files (e.g., `application.properties`).
ja_jp: Quarkus 設定ファイル (例: `application.properties`) にも同じアプローチを適用します。

source: It attempts to identify archives with Panache entities (and consumers of Panache entities) by the presence of the marker file `META-INF/panache-archive.marker`. Panache includes an annotation processor that will automatically create this file in archives that depend on Panache (even indirectly). If you have disabled annotation processors you may need to create this file manually in some cases.
ja_jp: この機能は、マーカーファイル `META-INF/panache-archive.marker` の存在によって Panache エンティティー の存在するアーカイブ(および Panache エンティティーの消費者) を識別しようとします 。Panache にはアノテーション プロセッサーが含まれており、 (間接的であっても) Panache に依存しているアーカイヴでこのファイルを自動的に作成します。アノテーションプロセッサーを無効にしている場合は、場合によってはこのファイルを手動で作成する必要があるかもしれません。

source: It attempts to identity archives with Panache entities (and consumers of Panache entities) by the presence of the marker file `META-INF/panache-archive.marker`. Panache includes an annotation processor that will automatically create this file in archives that depend on Panache (even indirectly). If you have disabled annotation processors you may need to create this file manually in some cases.
ja_jp: これは、マーカーファイル `META-INF/panache-archive.marker` の存在によって、Panache エンティティを持つアーカイブ（および Panache エンティティのコンシューマー）を識別しようとするものです。Panacheには、Panacheに（間接的にでも）依存しているアーカイブでこのファイルを自動的に作成するアノテーションプロセッサが含まれています。アノテーションプロセッサを無効にしている場合、場合によってはこのファイルを手動で作成する必要があります。

source: It can also be useful to define a xref:cdi.adoc#ok-you-said-that-there-are-several-kinds-of-beans[CDI bean producer] redirecting to the currently active datasource, like this:
ja_jp: 次のように、現在アクティブなデータソースにリダイレクトする xref:cdi.adoc#ok-you-said-that-there-are-several-kinds-of-beans[CDI Beanプロデューサ] を定義することも有用です：

source: It can be activated and configured as follows:
ja_jp: これは、次のようにアクティブ化および設定できます。

source: It can be enabled as follows:
ja_jp: 有効にするには、以下を実行します。

source: It can be fairly easy to avoid these situations in our own code, but it is hard to verify every dependency we use. Typically, while experimenting with virtual-threads, we realized that using the link:{pgsql-driver}[postgresql-JDBC driver] results in frequent pinning.
ja_jp: 自分たちのコードでこのような状況を回避するのはかなり簡単ですが、使用する依存関係をすべて検証するのは困難です。典型的な例としては、仮想スレッドの実験をしているときに link:{pgsql-driver}[postgresqlのJDBCドライバ] を使うと拘束が多発することに気づきました。

source: It can be further customized by using a `quarkus.oidc-client.grant-options.password` configuration prefix, similar to how the client credentials grant can be customized.
ja_jp: さらに、 `quarkus.oidc-client.grant-options.password` という設定プレフィックスを使用して、クライアント認証のグラントをカスタマイズする方法と同様に、カスタマイズすることが可能です。

source: It can be further customized using a `quarkus.oidc-client.grant-options.password` configuration prefix, similarly to how the client credentials grant can be customized.
ja_jp: これは、クライアント認証情報のグラントをカスタマイズする方法と同様に、 `quarkus.oidc-client.grant-options.password` 設定接頭辞を使用してさらにカスタマイズできます。
